["When you’re showing off the next book you want banned with the perfect edges and everything to underscore to everyone you haven’t actually read it https://t.co/XNBqBOlxsC", "Senator Braun’s statement does not walk back what he said.\n\nHe needs to go on the record to clarify whether he believes states should be allowed to reinstate anti-miscegenation laws, and whether it’s his belief SCOTUS should overturn Loving v. Virginia as he does w/ Roe v. Wade", "Can journalists please not pretend it’s normal for a US Senator to declare that the Supreme Court was wrong to legalize interracial marriage, he’s OK w/it being illegal again, his “new” statement not walking anything back during a SCOTUS nomination that he’d be voting on? Thanks. https://t.co/HOoaEEyuWK", "When you’re far more qualified 😊😊 than the person determining your qualifications 😊😊😊 https://t.co/pE7xmjulrH", "So many peoples’ lives are actually endangered for their views, yet these 1st amendment screeds only seem to crop up in defense of the historically powerful claiming minority status. Until it shows up for everyone, it’s merely a service for the powerful, not a challenge of it.", "Booo corny tomato tomato tomato 🍅 🍅 \n\nI’m on team “embarrassing racists is our first amendment right, not their first amendment violation” thanks", "Imagine living in the US today, where the #1 source of domestic terrorism is far-right groups(per FBI!), books about slavery are getting banned, parents are criminalized for trans kids, yet asserting the 1st amendment is about protecting bigots from feeling embarrassed in public.", "Wonder what my Dem colleagues welcoming this kind of support think about this position.", "So…AIPAC is now endorsing &amp; donating to Republicans who voted to overturn the US election on Jan 6th because, according to their statement, it’s more OK to dismantle US democracy than it is to question if US tax dollars should fund detention &amp; abuse of Palestinian kids.\n\nGot it. https://t.co/5SY5JY9Vd9", "Hell yes 🙌🏽 can’t wait for some union made coffee in the morning! https://t.co/e5iVmyegVF", "NYC Protip: the Q70 bus to LaGuardia is FREE 💸 all this week, starting today! 🚎 🚌 🚃 Shout out to the @MTA\n\nPlease take the public transit to the airport if you can. It’s faster than getting stuck on the BQE behind a fender bender &amp; walking from the highway (yes this happens!)", ".@AyannaPressley just brought the FIRE on the House floor speaking in favor of passage for the #CROWNAct just now. Wow 🔥🔥🔥", "You’ll also learn a lot about who has access to public options and who doesn’t.", "I mean seriously. Next time someone wants to brag about how capitalist they are &amp; pop off about how much they believe in and love free markets, challenge them to name them.\n\nName the significant markets that impact people’s lives that are actual free markets. You’ll learn a LOT", "Your medicine would be much, much cheaper if the billions in PUBLICLY funded research and development of  treatments were treated like public investments requiring a return rather than multi-billion giveaways to big pharma once a cure is developed. \n\nAnd so on and so forth.", "If public, socially owned, or cooperative housing was widely available, many would choose that over being held hostage by a private equity co charging 60% of your $ for a small apt.\n\nOr you’d choose to buy a home if it wasn’t being gobbled up by those same co’s capturing the mkt", "If you think gas is expensive now, imagine if we actually had to pay the true price w/o the insane gov subsidies and favoring granted to them.\n\nIf fossil fuel companies didn’t have such tipped scales for them it’s very likely we’d be much further along w/ cheaper alternatives", "Many folks run around claiming to be “free-market” capitalists, but what they actually are is captured market capitalists, using subsidies + restrictive policy to hold us hostage to fossil fuels, for-profit healthcare/housing, etc that many wouldn’t choose if they had the choice", "Same goes for pretty much every other industry - big pharma, Wall Street, etc etc", "Truly bizarre how in Washington it’s totally allowed + acceptable to accept hundreds of thousands in fossil fuel money + own millions in fossil fuel investments while brazenly killing clean energy policy, but what’s NOT acceptable is raising that fact &amp;questioning the connection. https://t.co/JAErvnsIBP", "Profiteering. And there should be consequences for it. https://t.co/4JJSJWySut", "Called it https://t.co/J0ZIxdBYCK", "Join us for a shift this week! https://t.co/a1VMR2PqsN", "Members of Congress trading stocks while having access to sensitive info + writing policy is already bad, but buying up defense contractor stock while receiving classified briefings on Ukraine and voting on US involvement? 👹👹👹 textbook case as to why this should be illegal", "In related news, we’ve heard that we’re soon getting a hearing date on banning members of Congress from trading individual stock while in office.\n\nThere’s still a lot of resistance in Congress, though. Keep pushing. Because lots of ppl are really trying to protect this behavior⬇️ https://t.co/CGvwV4eZmi", "What if… the people working overtime to keep first graders trapped in school lunch debt are the baddies 🤔 https://t.co/SQDSOdfgW9", "Unemployment also hit 14.8% in 2020, the highest rate ever seen in the US since data collection began.\n\nDoes the Senator want to jump to claim that as Trump’s legacy too? Or would we rather examine context and data like adults? 👩🏽‍🏫", "Maybe that has something to do with the fact that everyone in the country was quarantining while 350,000 people died and COVID vaccines weren’t out yet https://t.co/QJkeCM88bB", "Anyways, apologies for the long thread but sometimes it’s important to dive a bit deeper. If you’re a person who has genuine questions on this issue, let me know! Happy to explore them together", "2nd, there’s a lot of Fed policy to tackle.\n\nOne area I’ve spent time on is our long-neglected public housing policy, where we advanced legislation to repeal Faircloth &amp; make ambitious investments like those in GND for Public Housing. But there’s so much more beyond that as well.", "That’s why @CouragetoChange’s focus this year is helping people identify their local pro-housing candidates across the country. Local candidates who take the pledge are listed here.\n\nEither way, *always* ask candidates if they take money from these lobbies.https://t.co/K6JXmCH2Vh", "So, what can we do about it?\n\nA lot!\n\nFirst, one of the fastest-impact areas you can make change is on the local level. Local elections are very relevant to cost of housing in your area. There’s a lot to explore non-electorally too, like community land trusts, tenants’ unions,etc", "If you see pols who are consistently in favor of endlessly exploding budgets for police/surveillance/jails, dig in &amp; explore what their relationship to real estate &amp; other lobbies, or what their housing, school, and public health policies consist of.\n\nIt’ll often tell you a lot.", "or # of officers will “fix” the crises of housing or violence created by powerful interests, but it really just serves to cover up a crisis that we’re all suffering from\n\nIt’s a slam dunk for politicians cozy w/ big money interests to distract from their relationship w/ them", "Fact is causes for crime and homelessness can have many complex and contributing factors.\n\nBy the time they surge, a web of policies and decisions have already driven that result - housing costs, community disinvestment, lobbying, etc. It’s an easy sell to think one department /2", "The housing crisis is exploding.\n\nOne perk for many politicians &amp; media working to make people’s knee-jerk reaction to homelessness be policing is it keeps ppl from seeing + organizing against the larger powers driving the housing crisis, like private equity + real estate lobbies https://t.co/2Z61ocPBo7", "Thank you @NewYorkStateAG 👏🏽 👏🏽 https://t.co/of1xruK3w7", "What’s worse is that ppl use anecdotes from their uncle at dinner to insist activist demands had an electoral impact, but even Dem party data showed that it had no sig impact on midterms. The political argument lacks evidence, yet we’re doing this anyway &amp; we’re not getting safer", "Shout out to everyone working to explode funding for surveillance programs like these across the country under the guise of “fund the police” when in fact police budgets are already at some of their highest levels in US history across the country. 🤗 no facts, just vibes https://t.co/7BwKmYFuUR", "I’ve asked some places the past, too! “How does X outlet decide what merits a check? What are your standards?” I have yet to hear a good, consistent answer. If someone does this well I would love to learn about it", "One thing I have learned about many fact-check operations is that while the facts of a given matter may be “objective,” who/when/what they check or publish seems almost entirely subjective. They rarely share their standards for what meets a check, which leads to moments like this https://t.co/M1e1NDNCqE", "Meanwhile, for those of us representing communities struggling w/ public safety (&amp; not just hearing about it on TV), we don’t get the investments needed to actually reduce harm and invest in our communities.\n\nHarm then continues, non-evidence based policy resurges, rinse, repeat", "If you look at NYC, what are the *evidence*-based reasons for resuming UN-deemed torture practices in the form of solitary to Rikers?\n\nWhat’s the evidence to revive the plainclothes unit, which despite being 5% of the force was responsible for 31% of police killings over 20 yrs?", "This is the saddest part of this whole conversation.\n\nThe cost of constantly playing political football w/public safety is a total lack of serious discussion &amp; investment in actual evidence-based approaches to reducing violence + harm. Polling becomes more important than outcomes https://t.co/vYAOL2INTC", "Congressman @GregCasar has a pretty nice ring to it! ☺️\n\nCongratulations, Texas 🎉 Greg will be a fantastic representative. https://t.co/tSI2B6HkTd", "She’s right 🤷🏽‍♀️ and that’s why the type of members who trade stock while holding public office were the ones throwing a tantrum about her making this WFP address that literally happens every year https://t.co/wafyyvRToy", "Doesn’t want to alienate his base https://t.co/a6m4H5aYgQ", "McCarthy stood on the House floor and passionately defended Rep. Gosar, who also  headlined fundraisers for white nationalist orgs &amp; escalated into inciting violence in the House. He made it fair game.\n\nIt’s not an exaggeration in the slightest to say he works to protect them.", "McCarthy has been protecting his little KKK Caucus for years with these toothless statements and meetings.\n\nIt’s how he covers for them.\n\nHe’s now helped them for so long they’ve escalated their open antisemitism &amp; collaboration w/ white nationalist groups. He’s just as culpable. https://t.co/on4twfags5", "Texans, TOMORROW is our shot to vote for healthcare, wages, and a better future.\n\nIt’s time to cast your ballot for @JCisnerosTX &amp; @GregCasar. 🗳\n\nAre you voting before or after work? Have you already voted? Share your voting plan and bring some friends + fam to the polls. ⬇️ https://t.co/b7edivDjtM", "I’ve sat on a committee with this guy for years. He talks like this every day.  🙃 https://t.co/YlPEdLR1rl", "Imagine if defunding schools was as politically controversial as not wanting to fund robodogs and mass surveillance. Imagine if police depts had to meet even a fraction of the financial scrutiny &amp; performance auditing that our schools do.\n\nJust wild what we’ve learned to accept. https://t.co/QRFWoGoFBY", "It’s not within the realm of political commentary, &amp; it’s not just me. He regularly targets people that do not have access to resources for protection. Once he gets to fantasizing about “booty calls” of women on national TV I cease to see the political value outside of incitement", "I genuinely want to know why Tucker Carlson is allowed/paid to engage in clear, targeted, libelous harassment that endangers people &amp;drives so many violent threats that ppl have to fundraise for their own safety.\n\nWhy should they have to pay for his harassment? Make it make sense", "Because:\na) they prev. wouldn’t vote to limit their own enrichment &amp;\n\nb) they score political points by voting down COLA, housing, &amp;/or work deductions. Except paying 2 rents for a job isn’t normal so they end up trading as a workaround\n\nThe good news: public pressure is working! https://t.co/x8i7itWBcY", "Any man that talks like this will treat any woman like this.\n\nDoesn’t matter if you’re Republican, Democrat, or neither, this is clearly not a safe person to leave alone w/ women.\n\nOnce again, the existence of a wife or daughters doesn’t make a man good. And this one is basura 🚮", "Remember when the right wing had a meltdown when I suggested they exhibit obsessive impulses around young women?\n\nWell now Tucker Carlson is wishing for… this on national TV.\n\nYou’re a creep bro. If you’re this easy w/ sexual harassment on air, how are you treating your staff? https://t.co/RFbOIRSmxQ", "This is the type of stuff you say when your name starts with a P and ends with dejo https://t.co/92chHFQUN7", "Truly wild how these folks called the shots &amp; got their desired nominees, agenda, priorities, legislative order, and excluded us from participating in campaigns yet find no shortage of ppl willing to write as their uncritical stenographers. This is how capital &amp; power works folks", "Here’s what’s really going on: those mods signed a letter in Aug holding the entire party agenda hostage demanding BBB NOT pass w/BIF, sinking Biden’s plan.\n\nNow CTC expired &amp;they don’t know how to accept responsibility so are lazily blaming the same folks they always do.The end. https://t.co/J7j1uiW15r", "If you haven’t gotten your Girl Scout cookies this year (or would like more), please consider getting some from Troop 6000. \n\nOrdering them here will help expand the Troop to more shelters &amp; bring the scouting experience to girls experiencing homelessness:\nhttps://t.co/c9jUhP5n5M", "In good news: 5 years ago, our community came together to establish #Troop6000, the first Girl Scout troop founded by+for girls experiencing homelessness.\n\nLast night Hailey V. made history as our country’s 1st-ever Gold Award recipient from Troop 6000.\n\nWe are so proud of her.💞 https://t.co/USlWDGXHMZ", "Meanwhile the press talks about it like it’s some beltway drama without ever showing the people who are sleeping in bubble jackets with no heat or the kids going hungry waiting for some guy in a yacht to decide if they are fully human or not. It’s just shameful, all of it", "One US Senator “heard stories” about people allegedly using the Child Tax Credit “for drugs” without any evidence or data to back it up.\n\nHe then used that as justification to nuke the entire national program, causing millions of kids to fall into poverty in weeks. Horrifying https://t.co/kOyuFp6ig4", "Child tax credit expired Dec 31st and it was many people’s lifeline to feed and clothe their kids. Politicians let it expire overnight with a shrug, but now want to feed into the sensationalism around crime acting like shoplifting has nothing to do with their actions. Wild.", "When I talk about violent conditions, this is what I mean.\n\nBut hey, it’s much easier to frame people who steal baby formula and medicine as monsters to be jailed than acknowledge our politics and economic priorities create conditions where people steal baby formula to survive. https://t.co/u5BU8S8nVH", "Ever wonder how to get on the ballot and run in NY?\n\nWell, we’re here to teach you and set you up for practice! Our first online petition training is TONIGHT at 6:30.\n\nJoin us &amp; sign up for an in-person shift! You’ll make some great friends with shared values along the way :) https://t.co/kUL3hIOqgB", "Fox News analysts already reaping the benefits of banning books, I see https://t.co/zFRBULnb0r", "Thanks! One funny aspect of this is sometimes a detractor will aggressively approach me in person, expecting me to be whatever media has led them to believe, and has no idea what to do after we start talking &amp;they see how misleading it is. The shock creates space for conversation https://t.co/Cda4TeoZB8", "Like I said, weirdos https://t.co/jTORwHc4JA", "Ted Cruz could never https://t.co/lGAO45uuy2", "Change happens one conversation at a time. https://t.co/r5UMCelVSW", "🙇🏽‍♀️ https://t.co/GiPTwzsrMW", "What are some of your favorite books / resources about housing?", "For real though when you see how the GOP openly embrace and leverage fascist members of their party vs how much some Dems run away and frame their own base mobilizers as “just as extreme” it’s not hard to see how that asymmetry/false equivalence has contributed to where we are", "At least she leads by example. She clearly banned all books from her house years ago https://t.co/SGMheBuFzn", "Well, since he decided to bring me into this…\n\nDid you know that Cuéllar is an anti-choice Dem in a state where women &amp; LGBTQ+ repro rights are under attack?\n\nThis district has only gotten bluer, too. It’s 2022. We really don’t have to settle for rock bottom. Vote @JCisnerosTX https://t.co/ry4brOTiaO", "Deep thoughts with Jack Handey over here https://t.co/9fhii4C49Q", "Immigrant and Latino communities notice this hypocrisy on immigration big time too", "It’s shameful how both parties fight tooth + nail to defend their ability to pump endless public money into militarization.\n\nFrom tanks in police depts to corrupt military contracts, funding this violence is bipartisan + non-controversial, yet healthcare + housing isn’t. It’s BS. https://t.co/rIPMfjE8NV", "Texans, are you ready? 🤠\n\nWe’re coming in for a major DOUBLE-RALLY next Saturday, Feb 12th to send @GregCasar + @JCisnerosTX to Congress and support community organizing across the state.\n\nThis one’s going to be special.\nJoin us &amp; RSVP now: https://t.co/55NVE4nEpi https://t.co/26HdXdgmRL", "On Capitol Hill, interns are often unpaid, many staffers don’t make a living wage, and lack of work protections can pave the way for unhealthy environments.\n\n@RepAndyLevin is right - sounds like a perfect place for a union. ⬇️⬇️ https://t.co/AVc9djfROj", "Cancel vacation. Vote on weekends. Vote for hours. Vote last minute. Call votes when Senators are courting billionaires at fundraisers. They may get apoplectic, but it’s nothing compared to the people they’re forcing to sleep without heat in winter, or losing the right to vote.", "Actually he should continue to make their lives as difficult as possible and treat them the way they treat, say, public housing residents. Or parents who rely on CTC. When they improve, maybe process can improve too.\n\nWhy should we make the lives of obstructionists easier? https://t.co/KBbX8DbYdo", "Yeah it’s bad 😬 https://t.co/XF7W0K72FB", ".@CongressmanRaja, @JoeNeguse and I have worked to ban members of Congress from trading individual stock for YEARS.\n\nLots of stories about the attempts to sink it - but now, thanks to increased public pressure + attention, we may have a shot.\n\nKeep up the pressure 💪🏽 it’s working https://t.co/g9iMhfybfv", "Seniors, kids, &amp; people with disabilities in my community have been sleeping with bubble jackets on in 18 degree nights, despite paying rent, bc the NYCHA funding to fix their heating and capital needs is in BBB.\n\nWhere should I direct them to wait out the cold? Manchin’s yacht? https://t.co/vXwbVX30ca", "Find it here: https://t.co/K6JXmCH2Vh", "Are you running/thinking of running in a local election (ex: council race) to help make things better?\n\nI want to help - especially in tackling our housing crisis. We need people running everywhere. Check out our @CouragetoChange endorsement page to learn more.\n\nGood luck! 🗳 https://t.co/GOLgGRXGxL", "The suggestion that any job is “low skill” is a myth perpetuated by wealthy interests to justify inhumane working conditions, little/no healthcare, and low wages.\n\nPlus being a waitress has made me and many others *better* at our jobs than those who’ve never known that life. https://t.co/dhkhBwyNWK", "Happy New Year everyone 🎊🪅 may we all enjoy a meaningful, healthy, and blessed year to come.", "The fact that these people are so creepy/weird yet are also the ones responsible for shaping the NEWS HEADLINES we all see in media should be really concerning. \n\nI don’t even want to know what knuckle-dragging thoughts these people have all day while covering women in politics", "I’m glad you felt the need to share that with the world.\n\nDon’t worry, this is a totally normal thought to have and share as an editor of a right-wing website, and totally doesn’t prove my point at all.\n\nI hear if you say it enough times you’ll actually start to believe it 😌 https://t.co/uBQrWFNM9m", "It’s starting to get old ignoring the very obvious, strange, and deranged sexual frustrations that underpin the Republican fixation on me, women,&amp; LGBT+ people in general.\n\nThese people clearly need therapy, won’t do it, and use politics as their outlet instead. It’s really weird", "If Republicans are mad they can’t date me they can just say that instead of projecting their sexual frustrations onto my boyfriend’s feet.\n\nYa creepy weirdos https://t.co/Z7bZCgXpWJ", "I’d also be happy to share some notes from @GovKathyHochul’s work in NY since he seems to be in need of tips!", "Hasn’t Gov. DeSantis been inexplicably missing for like 2 weeks?\n\nIf he’s around, I would be happy to say hello. His social media team seems to have been posting old photos for weeks.\n\nIn the meantime, perhaps I could help with local organizing. Folks are quite receptive here :) https://t.co/LmmqT8eLDh", "Sometimes, in a quiet or difficult moment, Harry Reid would reach out. It was like he knew.\n\nHis counsel, encouragement, kindness, and generosity was so deeply moving. It was sincere. And I will never forget it.\n\nThank you, Senator Reid. Wishing peace and strength to his family.", "Protip: Do not do this 🤣 https://t.co/tOTM1X2pX4", "I truly will never adjust to how normal it is in our country to completely dehumanize people once they fall below a certain income.\n\nThis is a fmr police commissioner talking about ppl like furniture or animals when his job ostensibly was to protect them too. Telling on himself."]